Show / Hide Table of Contents
Class SteelSetupHKG
Steel setup IND class
Inheritance
System.Object
SteelSetup
SteelSetupHKG
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SteelSetupHKG : SteelSetup
Methods
Improve this Doc   View Source
FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
Declaration
public override double FrictionCoefficientPboltDefault()
Returns
 Type |  Description
 System.Double
Overrides
SteelSetup.FrictionCoefficientPboltDefault()
 Improve this Doc
 View Source